tap "antoniorodr/memo"
tap "apenngrace/vulkan"
tap "bendews/tap"
tap "cirruslabs/cli"
tap "coder/coder"
tap "dagger/tap"
tap "dart-lang/dart"
tap "hashicorp/tap"
tap "hudochenkov/sshpass"
tap "humanlayer/humanlayer"
tap "hyperboliclabs/hyperbolic"
tap "jcudit/webkitgtk"
tap "kamilturek/python2"
tap "linuxkit/linuxkit"
tap "minio/stable"
tap "mistertea/et"
tap "openresty/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "slp/krunkit"
tap "steipete/tap"
tap "strongdm/tap"
tap "supabase/tap"
tap "tabbyml/tabby"
tap "yakitrak/yakitrak"
brew "age"
brew "little-cms2"
brew "aom"
brew "apachetop"
brew "ast-grep"
brew "libxcb"
brew "autoconf"
brew "automake"
brew "boost"
brew "libusb"
brew "avrdude"
brew "aws-vault"
brew "awscli"
brew "node"
brew "basedpyright"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "bitwarden-cli"
brew "black"
brew "ccache"
brew "clisp"
brew "cloudflared"
brew "cmake"
brew "cocoapods"
brew "ripgrep"
brew "codex"
brew "lima"
brew "colima"
brew "container", link: false
brew "coreutils"
brew "cosign"
brew "curl"
brew "dfu-util"
brew "direnv"
brew "djvulibre"
brew "dnsmasq"
brew "duckdb"
brew "e2fsprogs"
brew "enchant"
brew "eza"
brew "fastlane"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "pango"
brew "ffmpeg@4"
brew "ffmpeg@7"
brew "fzf"
brew "libmpc"
brew "gemini-cli"
brew "gh"
brew "ghcup"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-lfs"
brew "git-xet"
brew "gitui"
brew "glfw"
brew "gnupg"
brew "gpgme"
brew "gnu-sed"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "grip"
brew "gtk+"
brew "gtk+3"
brew "helix"
brew "helm"
brew "himalaya"
brew "htop"
brew "httpie"
brew "huggingface-cli"
brew "hugo"
brew "hunspell"
brew "icu4c@76"
brew "idris2"
brew "libheif"
brew "imagemagick"
brew "ios-deploy"
brew "istioctl"
brew "isync"
brew "jello"
brew "jq"
brew "json-c"
brew "just"
brew "k9s"
brew "kakoune"
brew "kustomize"
brew "libfido2"
brew "libfixposix"
brew "libgccjit"
brew "libraqm"
brew "libraw"
brew "librsvg"
brew "libvterm"
brew "qemu"
brew "lima-additional-guestagents"
brew "livekit"
brew "livekit-cli"
brew "llama.cpp"
brew "llm"
brew "llvm"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "ninja"
brew "meson"
brew "minica"
brew "minimal-racket"
brew "mise"
brew "molten-vk"
brew "mosh"
brew "mu"
brew "zlib"
brew "mysql-client"
brew "nebula"
brew "neovim"
brew "nvm"
brew "oath-toolkit"
brew "ollama", link: false
brew "opam"
brew "openai-whisper"
brew "openbao"
brew "openjdk@11"
brew "openjdk@17"
brew "pandoc"
brew "perl"
brew "pillow"
brew "pinentry-mac"
brew "pipx"
brew "pnpm"
brew "poppler"
brew "portaudio"
brew "postgresql@14"
brew "potrace"
brew "procs"
brew "python@3.11"
brew "rbenv"
brew "redis"
brew "rlwrap"
brew "rocq"
brew "roswell"
brew "ruff"
brew "rustup"
brew "sbcl"
brew "sops"
brew "sphinx-doc"
brew "stow"
brew "swiftformat"
brew "syncthing", restart_service: :changed
brew "tcl-tk"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "uv"
brew "vscli"
brew "watch"
brew "webkit2png"
brew "wget"
brew "wireguard-tools"
brew "wireshark", link: false
brew "xcodegen"
brew "yarn"
brew "ykman"
brew "zig"
brew "zk"
brew "antoniorodr/memo/memo"
brew "bendews/tap/apw"
brew "cirruslabs/cli/tart"
brew "coder/coder/coder"
brew "dagger/tap/dagger"
brew "hashicorp/tap/packer"
brew "hudochenkov/sshpass/sshpass"
brew "hyperboliclabs/hyperbolic/hyperbolic"
brew "linuxkit/linuxkit/linuxkit", args: ["HEAD"]
brew "minio/stable/mc"
brew "mistertea/et/et"
brew "qmk/qmk/qmk"
brew "slp/krunkit/krunkit"
brew "steipete/tap/bird"
brew "steipete/tap/camsnap"
brew "steipete/tap/gifgrep"
brew "steipete/tap/gogcli"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/sag"
brew "steipete/tap/songsee"
brew "steipete/tap/summarize"
brew "steipete/tap/wacli"
brew "supabase/tap/supabase"
brew "yakitrak/yakitrak/obsidian-cli"
cask "1password-cli"
cask "alacritty"
cask "anaconda"
cask "android-platform-tools"
cask "anki"
cask "bitwarden"
cask "caffeine"
cask "calibre"
cask "claude-code"
cask "humanlayer/humanlayer/codelayer-nightly"
cask "codex"
cask "container"
cask "cord"
cask "discord"
cask "fedora-media-writer"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "ghostty"
cask "gstreamer-development"
cask "gstreamer-runtime"
cask "hammerspoon"
cask "icanhazshortcut"
cask "jamulus"
cask "jd-gui"
cask "jdownloader"
cask "keka"
cask "linear-linear"
cask "lm-studio"
cask "logseq"
cask "macfuse"
cask "netnewswire"
cask "nordvpn"
cask "nvidia-geforce-now"
cask "obs"
cask "obsidian"
cask "ollama-app"
cask "orbstack"
cask "pomatez"
cask "postgres-unofficial"
cask "proton-mail-bridge"
cask "session-manager-plugin"
cask "signal"
cask "skim"
cask "slack"
cask "sol"
cask "stats"
cask "tailscale-app"
cask "telegram"
cask "tidal"
cask "unetbootin"
cask "ungoogled-chromium"
cask "visual-studio-code"
cask "whatsapp"
cask "winbox"
cask "wine-stable"
cask "wireshark-app"
cask "zed"
cask "zotero"
vscode "alefragnani.bookmarks"
vscode "astral-sh.ty"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "boundary.baml-extension"
vscode "bscribe.bscribe-vscode"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "equimper.react-native-react-redux"
vscode "figma.figma-vscode-extension"
vscode "fudd.toggle-zen-mode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "james-yu.latex-workshop"
vscode "keifererikson.nightfox"
vscode "mattn.lisp"
vscode "max-ss.cyberpunk"
vscode "mitsuhiko.insta"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-server"
vscode "redhat.vscode-yaml"
vscode "rszyma.vscode-kanata"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/user/claude-langfuse-go/cmd/claude-langfuse"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
cargo "claude-code-cli-acp-rs"
cargo "crime-report"
cargo "errstream"
cargo "purzlig-lsp"
cargo "selene"
cargo "sqlx-cli"
cargo "stylua"
cargo "ultrahamster"
cargo "xcp"
