# tap "1password/tap"
tap "apenngrace/vulkan"
# tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "homebrew/services"
tap "jcudit/webkitgtk"
tap "minio/stable"
tap "mistertea/et"
tap "openresty/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "supabase/tap"
tap "tabbyml/tabby"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Top-like display of Apache log
brew "apachetop"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Collection of portable C++ source libraries
brew "boost"
# Library for USB device access
brew "libusb"
# Atmel AVR MCU programmer
brew "avrdude"
# Official Amazon AWS command-line interface
brew "awscli"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Object-file caching compiler wrapper
brew "ccache"
# GNU CLISP, a Common Lisp implementation
brew "clisp"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Proof assistant for higher-order logic
brew "coq"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# DjVu viewer
brew "djvulibre"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"


# Pack, ship and run any application as a lightweight container
# brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
# brew "docker-buildx"
# Isolated development environments using Docker
# brew "docker-compose"
# Platform keystore credential helper for Docker
# brew "docker-credential-helper"
# Docker Credential Helper for Amazon ECR
# brew "docker-credential-helper-ecr"
# Docker Machine driver plugin for Vultr Cloud
# brew "docker-machine-driver-vultr"
# Utilities for the ext2, ext3, and ext4 file systems

brew "e2fsprogs"
# Lean Theorem Prover installer and version manager
# brew "elan-init"
# Spellchecker wrapping library
brew "enchant"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Rust toolchain installer
brew "rustup"
# Multi-platform library for OpenGL applications
brew "glfw"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GitHub Markdown previewer
brew "grip"
# GUI toolkit
brew "gtk+"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Client library for huggingface.co hub
brew "huggingface-cli", link: false
# Spell checker and morphological analyzer
brew "hunspell"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Next-gen compiler infrastructure
brew "llvm@12"
# Pure functional programming language with dependent types
brew "idris"
# Pure functional programming language with dependent types
brew "idris2"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Synchronize a maildir with an IMAP server
brew "isync"
# Filter JSON and JSON Lines data with Python syntax
brew "jello"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Selection-based modal text editor
brew "kakoune"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Thin wrapper over POSIX syscalls
brew "libfixposix"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Library for complex text layout
brew "libraqm"
# Library to render SVG files using Cairo
brew "librsvg"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Generic machine emulator and virtualizer
brew "qemu"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Small, simple certificate authority
brew "minica"
# Modern programming language in the Lisp/Scheme family
brew "minimal-racket"
# Implementation of the Vulkan graphics and compute API on top of Metal
brew "molten-vk"
# Remote terminal application
brew "mosh"
# Tool for searching e-mail messages stored in the maildir-format
brew "mu"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Scalable overlay networking tool for connecting computers anywhere
brew "nebula"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", link: false
# OCaml package manager
brew "opam"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Modern replacement for ps written in Rust
brew "procs"
# Strongly typed programming language that compiles to JavaScript
brew "purescript"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Lisp installer and launcher for major environments
brew "roswell"
# Steel Bank Common Lisp system
brew "sbcl"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Open source continuous file synchronization application
brew "syncthing", restart_service: :changed
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", restart_service: :changed
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# CLI/TUI that launches VSCode projects, with a focus on dev containers
brew "vscli"
# Create screenshots of webpages from the terminal
brew "webkit2png"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark", link: false
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Plain text note-taking assistant
brew "zk"
# Interpreted, interactive, object-oriented programming language
brew "kamilturek/python2/python@2"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# Remote terminal with IP roaming
brew "mistertea/et/et"
# Scalable Web Platform by Extending NGINX with Lua
brew "openresty/brew/openresty"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Supabase CLI
brew "supabase/tap/supabase"
# Tabby: AI Coding Assistant
# brew "tabbyml/tabby/tabby"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Android SDK component
cask "android-platform-tools"
# Memory training application
cask "anki"
# Display management tool
cask "betterdisplay"
# E-books management software
cask "calibre"
# Free and open-source web browser
cask "chromium"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Remote desktop client
cask "cord"
# Tool to write Fedora images to portable media files
cask "fedora-media-writer"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Desktop automation application
cask "hammerspoon"
# Shortcut manager
cask "icanhazshortcut"
# Play music online with friends
cask "jamulus"
# Standalone Java Decompiler GUI
cask "jd-gui"
# Download manager
cask "jdownloader"
# File archiver
cask "keka"
# GPU-based terminal emulator
# cask "kitty"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Get up and running with large language models locally
cask "ollama-app"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# PDF reader and note-taking application
cask "skim"
# System monitor for the menu bar
cask "stats"
# Tool to install Linux/BSD distributions to a partition or USB drive
cask "unetbootin"
# Administration tool for MikroTik RouterOS
cask "winbox"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Network protocol analyzer
cask "wireshark-app"
# Multiplayer code editor
cask "zed"


