{
  "CamelCaseMotion": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "auto-dark-mode.nvim": { "branch": "master" },
  "cmp-buffer": { "branch": "main" },
  "cmp-calc": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-nvim-lua": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-spell": { "branch": "master" },
  "cmp_luasnip": { "branch": "master" },
  "dashboard-nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "distant.nvim": { "branch": "v0.3" },
  "dressing.nvim": { "branch": "master" },
  "friendly-snippets": { "branch": "main" },
  "github-nvim-theme": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "markdown-preview.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "neogit": { "branch": "master" },
  "neorg": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "org-bullets.nvim": { "branch": "main" },
  "orgmode": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "purescript-vim": { "branch": "main" },
  "rainbow_parentheses.vim": { "branch": "master" },
  "rustaceanvim": { "branch": "master" },
  "telescope-egrepify.nvim": { "branch": "master" },
  "telescope-file-browser.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-fzy-native.nvim": { "branch": "master" },
  "telescope.nvim": { "branch": "master" },
  "treesj": { "branch": "main" },
  "vim-commentary": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-startuptime": { "branch": "master" },
  "vim-vsnip": { "branch": "master" },
  "vlime": { "branch": "master" },
  "which-key.nvim": { "branch": "main" }
}